print('\nЗАВДАННЯ1:\nФункція визначення кількості голосних у рядку.\nНа вході маємо рядок з букв латинського алвафіту.\nВІДПОВІДЬ:')
#Завдання 1
def count (str):
    #ініціалізація змінної лшчильника до 0
    count1 = 0
    #створення набору голосних літер
    letter1=set('aeouyAEOUY')
    #цикл для проходження літер в заданому рядку
    for i in str:
        #якщо голосні літери присутні
        if i in letter1:
            count1=count1+1
    print("Речення: ",str)
    print("Кількість голосних літер: ",count1)
str='Hello world'
#виклик функції
count (str)

print('\nЗАВДАННЯ2:\nНапишіть функцію, яка виводить на екран\nформато-ваний текст, наведений нижче:\n“Don’t let the noise of others’\nopinions drown out your own inner voice.”\n','Steve Jobs'.rjust(39,' '),'\nВІДПОВІДЬ:')
# Завдання 2
cstr = 'Don’t let the noise of others’ opinions drown out your own inner voice.’ Steve Jobs'
a = cstr.split('’ ')

print(a[0].rjust(30,'"'),'\n',a[1].ljust(41,'"'),'\n',a[2].rjust(40,' '))

print('\nЗАВДАННЯ3:\nНапишіть функцію, яка перевіряє чи є шестизначне\nчисло «щасливим». Число передається як параметр.\nЯкщо число щасливе, поверніть з функції true, якщо ні — false.\n«Щасливе шестизначне число» — це число, в якому\nсума перших трьох цифр дорівнює сумі других трьох\nцифр. Наприклад, 123420 — щасливе 1+2+3 = 4+2+0,а\n723422 — нещасливе 7+2+3 != 4+2+2.\nВІДПОВІДЬ:')
# Завдання 3
num=input('Введіть шестизначне число: ')
def lucky_num(num):
    if sum(map(int, num[0:3])) == sum(map(int, num[-3:])):
        print('Ваше число щасливе')
    else:
        print('Ваше число не щасливе')
lucky_num(num)

